#include<iostream>
using namespace std;

int main(){
//    int age;
//    cout<<"欢迎体验程序员的一生，请输入你的年龄:"<<endl;
//    cin>>age;

//    if(age>=0 && age<3){
//        cout<<"小登，好好享受这段懵懂的时光"<<endl;
//    }
//    else if(age>=3 && age<7){
//        cout<<"这是你的幼儿园生涯，快乐的享受吧"<<endl;
//    }
//    else if(age>=7 && age<=12){
//        cout<<"恭喜你来到了小学，好好学习，好好玩耍"<<endl;
//    }
//    else if(age>12 && age<16){
//        cout<<"你已经来到了初中阶段，这是你人生中最重要的阶段，请好好珍惜，并且在你初三的时候，一定要好好学习，争取考上一个重点高中。"<<endl;
//    }
//    else if(age>=16 && age<=18){
//        cout<<"恭喜你来到了高中阶段，这是你人生中最重要的阶段，是人生的分水岭，在高一高二的时候打好基础，高三的时候认真复习备考，争取考上985大学"<<endl;
//    }
//    else if(age==19){
//        cout<<"你已经寒窗苦读12年，考入了著名的985大学，南开大学，你在第一年的课程比较少，请你打好学习基础的同时，也享受下大学生活，看世界，也找自己"<<endl;
//    }
//    else if(age==20){
//        cout<<"经过了大二的迷茫，你来到了课程比较多的大二年级，在这个时间段，你需要踏实学习，同时也要享受生活，学会取悦自己"<<endl;
//    }
//    else if(age>20){
//        cout<<"由于本人还没满20，就不多写了"<<endl;
//    }

    cout<<"小登，好好享受这段懵懂的时光->"<<endl;
    cout<<"这是你的幼儿园生涯，快乐的享受吧->"<<endl;
    cout<<"恭喜你来到了小学，好好学习，好好玩耍->"<<endl;
    cout<<"恭喜你来到了高中阶段，这是你人生中最重要的阶段，是人生的分水岭，在高一高二的时候打好基础，高三的时候认真复习备考，争取考上985大学->"<<endl;
    cout<<"你已经来到了初中阶段，这是你人生中最重要的阶段，请好好珍惜，并且在你初三的时候，一定要好好学习，争取考上一个重点高中。->"<<endl;
    cout<<"你已经寒窗苦读12年，考入了著名的985大学，南开大学，你在第一年的课程比较少，请你打好学习基础的同时，也享受下大学生活，看世界，也找自己->"<<endl;
    cout<<"经过了大二的迷茫，你来到了课程比较多的大二年级，在这个时间段，你需要踏实学习，同时也要享受生活，学会取悦自己->"<<endl;
    cout<<"由于本人还没满20，就不多写了->"<<endl<<endl;
    cout<<"上述内容，仅供娱乐(doge)"<<endl;

    return 0;
}